fuzzing/parse_header/input/POST4

POST http://127.0.0.1/iControl/iControlPortal.cgi HTTP/1.0
Accept-Charset: iso-8859-1,utf-8;q=0.9,*;q=0.1
Accept-Language: en
Connection: Keep-Alive
Content-Length: 1045
User-Agent: Mozilla/4.0 (compatible; MSIE 8.0; Windows NT 5.1; Trident/4.0)
Pragma: no-cache
Accept: image/gif, image/x-xbitmap, image/jpeg, image/pjpeg, image/png, */*

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope
 xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soapenv:Body>
    <ns1:download_file
     soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
     xmlns:ns1="urn:iControl:System/ConfigSync">
        <file_name xsi:type="xsd:string">/etc/passwd</file_name>
        <chunk_size href="#id0"/>
        <file_offset href="#id1"/>
    </ns1:download_file>
    <multiRef id="id1"
      soapenc:root="0"
      soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
      xsi:type="xsd:long"
      xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
      0
    </multiRef>
    <multiRef id="id0"
      soapenc:root="0"
      soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
      xsi:type="xsd:long"
      xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
      65536 
    </multiRef>
  </soapenv:Body>
</soapenv:Envelope>